package vk

const (
	msgMainMenu          = `Слушаю?`
	msgHelp              = `Я - твой сборник кино-рекомендаций на вечер! С моей помощью ты можешь сохранить фильмы на будущий просмотр, а когда придет время - нажми "Посоветуй фильм" и я выдам тебе случайное кино из твоего списка`
	msgDeletedAll        = `Я полностью удалил твою коллекцию. Если все-таки передумаешь - просто напиши "Привет". Начнем все с чистого листа (буквально)`
	msgHelp1             = `Во вкладке "Моя коллекция"" ты можешь добавить новый фильм или удалить добавленный раннее! НО УЧТИ: я ограничен технологиями своего времени и принимаю исключительно ссылки с Кинопоиска. Добавить один и тот же фильм дважды нельзя`
	msgHello             = `Привет!`
	msgUnknownCommand    = `Я просто бот, имитация жизни. Я не понимаю твое сообщение.`
	msgBotIsStupid       = `Этот бот пока что может работать только со ссылками на кинопоиск. Приношу извинения за временные неудобства! Обязательно обновлю функционал в будущем (нет).`
	msgNoSavedMovies     = `У тебя ещё нет сохранённых фильмов в коллекции. Хочешь добавить?`
	msgSaveMovie         = `Пришли мне ссылку на фильм с Кинопоиска и я её сохраню!`
	msgDeleteMovie       = `Пришли мне ссылку из твоей коллекции и я её удалю!`
	msgSaved             = `Поймал + сохранил!`
	msgAlreadyExists     = `Упс! Фильм, который ты пытаешься сохранить, уже есть в коллекции`
	msgAlreadyNotExists  = `А фильма и так нет в коллекции. Давай-ка мы его добавим, а потом удалим?`
	msgDelete            = `Удалил!`
	msgTY                = "Всегда пожалуйста!"
	msgStop              = `Если ты просто хочешь взять паузу - хорошо. Но если все серьезно и ты уходишь от меня: нажми "Очистить данные" и я удалю твою коллекцию.`
	msgCollectionMainFmt = `Твоя коллекция:
%s`
	msgCollectionPartFmt = `[%d] %s
`
)
