package vk

const (
	msgMainMenu         = `Слушаю?`
	msgHelp             = `Я - твой сборник кино-рекомендаций на вечер! С моей помощью ты можешь сохранить фильмы на будущий просмотр, а когда придет время - нажми "Посоветуй фильм" и я выдам тебе случайное кино из твоего списка`
	msgHelp1            = `Во вкладке "Моя коллекция"" ты можешь добавить новый фильм или удалить добавленный раннее! НО УЧТИ: я ограничен технологиями своего времени и принимаю исключительно ссылки с Кинопоиска. Добавить один и тот же фильм дважды нельзя`
	msgHello            = `Привет-привет!`
	msgUnknownCommand   = `Я просто бот, имитация жизни. Я не понимаю твое сообщение.`
	msgCollection       = `Желаешь добавить фильм или удалить?`
	msgNoSavedMovies    = `Ты еще не успел сохранить фильм. Хочешь это сделать?`
	msgSaveMovie        = `Пришли мне ссылку на фильм с Кинопоиска и я её сохраню!`
	msgSaved            = `Поймал + сохранил!`
	msgAlreadyExists    = `Упс! Фильм, который ты пытаешься сохранить, уже есть в коллекции`
	msgAlreadyNotExists = `А фильма и так нет в коллекции. Давай-ка мы его добавим, а потом удалим?`
	msgDelete           = `Удалил! Надеюсь, ты и правда его посмотрел!`
	msgTY               = "Всегда пожалуйста!"
	msgStop             = `Ладно, ладно, ухожу. Но оставлю тут кнопочку. На случай, если снова буду нужен`
)
